In [1]:
import pandas as pd

# Load the CSV file into a DataFrame
file_path = '~/Downloads/expense_data_1.csv'
attrition = pd.read_csv(file_path, parse_dates=['Date'])

# Display the first few rows of the DataFrame
attrition.head()

,Date,Account,Category,Subcategory,Note,INR,Income/Expense,Note.1,Amount,Currency,Account.1
0,2022-03-02 10:11:00,CUB - online payment,Food,NaN,Brownie,50.0,Expense,NaN,50.0,INR,50.0
1,2022-03-02 10:11:00,CUB - online payment,Other,NaN,To lended people,300.0,Expense,NaN,300.0,INR,300.0
2,2022-03-01 19:50:00,CUB - online payment,Food,NaN,Dinner,78.0,Expense,NaN,78.0,INR,78.0
3,2022-03-01 18:56:00,CUB - online payment,Transportation,NaN,Metro,30.0,Expense,NaN,30.0,INR,30.0
4,2022-03-01 18:22:00,CUB - online payment,Food,NaN,Snacks,67.0,Expense,NaN,67.0,INR,67.0

In [13]:
import sqlite3

# Connect to the SQLite database (it will create the database if it doesn't exist)
conn = sqlite3.connect('crm_subat.db')

# Write the DataFrame to a table named 'expense_data' in the database
attrition.to_sql('expense_data', conn, if_exists='replace', index=False)

# Close the connection
conn.close()

In [12]:
# Connect to the SQLite database
conn = sqlite3.connect('crm_subat.db')

# Execute the SQL command to drop the table
cursor = conn.cursor()
cursor.execute("DROP TABLE IF EXISTS expense_data")

# Commit the changes and close the connection
conn.commit()
conn.close()